#ifndef __PERIPHAL_PACKAGE_H__

#define __PERIPHAL_PACKAGE_H__

#include "stm32f10x.h"
#include <stdbool.h>
#include "motor.h"

// ============================== USART part =============================


// =========================== TIM part ==========================





// 软件封装函数库声明
// =========================== GPIO 部分 ==============================
void		GPIO_config(void);		// GPIO 配置
// =========================== 串口部分 ==============================

// =========================== 定时器部分 ==============================
void		TIM_config(void);		// TIM3 配置

// =========================== NVIC 部分 ==============================
void		NVIC_interupt_config(void);



// =========================== 电机控制 部分 ==============================

//void		PID_actual_duty_cycle_setting(PID_TypeDef* pid_struct);
// =========================== 舵机云台控制部分 ==========================



#endif
